#include <iostream>
#include <bits/stdc++.h>
using namespace std;

/*Функция которая возвращает оптималные банкноты для заданной суммы, пременная V это параметр, принимающий сумму
* S - переменная для суммы
* bills_size - параметр который принимает длинну массива
* bills - параметр который принимает массив с банкнотами
*/
void count_bills(int s, int bills_size, int bills[])
{
    //Инициализируем вектор для хранения подходяших банкнот
    //Выбираем вектор так как он может динамично изменять свой размер в отличии от массива
    vector<int> optin_bills;

    //Проходим по всему массиву с купюрами, проходим с конца так как самые крупные купюры у нас в концу массива
    for (int i = bills_size - 1; i >= 0; i--) {

        //Проверяем если выбранная банкнота подходит для нашой суммы
        //Проверяем в циклеб так как для большой суммы максимальная купюра может дублироваться
        while (s >= bills[i]) { //условие проверяет если банкнота меньше суммы
            s -= bills[i]; //вычитаем подходяшюю банкноту из нашой суммы(или остатка от суммы)
            optin_bills.push_back(bills[i]); //coхраняем подходяшюю банкноту в наш вектор
        }
    }

    //Выводим вектор с подходяшими купюрами на экран
    for (int i = 0; i < optin_bills.size(); i++) {
        cout << optin_bills[i] << "  ";
    }
}

/*Функция которая сортирует массив по возрастанию
* size_arr - параметр который принимает длинну массива
* arr - параметр который принимает массив для сортировки
*/
int * sort_array_asc(int size_arr, int arr[])
{
    int temp; // временная переменная для обмена элементов местами

    // Сортировка массива пузырьком
    for (int i = 0; i < size_arr - 1; i++) {
        for (int j = 0; j < size_arr - i - 1; j++) {
            if (arr[j] > arr[j + 1]) { // проверка если текущий элемент больше следующего
                // меняем элементы местами
                temp = arr[j];
                arr[j] = arr[j + 1];
                arr[j + 1] = temp;
            }
        }
    }

    // Вывод отсортированного массива на экран
    cout << "Отсортированный массив по возрастанию: ";
    for (int i = 0; i < size_arr; i++) {
        cout << arr[i] << " ";
    }
    cout << endl;

    return arr;
}

int main()
{
    setlocale(LC_ALL, "Russian"); // устанавливаем Locale настройки для вывода текста на русском

    int *arr; // указатель для выделения памяти под массив
    int size; // переменная для размера массива

    //Ввод количества элементов массива
    cout << "Введите количество банкнот ";
    cin >> size;

    // Размер масива должен быть больше 0
    if (size <= 0) {
        cout << "Размер массива должен быть больше 0!";
        return 1;
    }

    arr = new int[size]; // выделение памяти под массив

    // заполнение массива
    for (int i = 0; i < size; i++) {
        cout << "arr[" << i << "] = ";
        cin >> arr[i];
    }

    // Вывод отсортированного массива на экран
    cout << "Введенные банкноты: ";
    for (int i = 0; i < size; i++) {
        cout << arr[i] << " ";
    }
    cout << endl;

    // Сортируем наш массив и выводим его используя функцию sort_array_asc
    int * sort_array = sort_array_asc(size, arr);

    // Вводим желаемую сумму для обработки
    int sum;
    cout << "Введите сумму и нажмите Enter: ";
    cin >> sum; //принимаем введенное число с клавиатуры

    // Разбиваем сумму на купюры и выводим ее с помощью функции
    cout << "Введеная вами сумма " << sum << " состоит из следующих купюр: ";
    count_bills(sum, size, sort_array);

    return 0;
}
